In [5]:
import pandas as pd

## Data Type

In [2]:
1

1

In [3]:
# int == integer == 정수형

type(1)

int

In [4]:
1.0

1.0

In [5]:
# float == 실수형

type(1.0)

float

In [7]:
# str == string == 문자열
# type은 파이선 기능

type("Hello World")

str

In [14]:
# 리스트에 int type만 있을 때
# dtyes는 판다스 기능

data = [1, 3, 5, 7, 9]
data = pd.Series(data)

data.dtypes

dtype('int64')

In [16]:
# 7.0을 추가하고난 뒤 타입이 float 으로 변경

data = [1, 3, 5, 7.0, 9]
data = pd.Series(data)

data.dtypes

dtype('float64')

In [17]:
# O == object == str == 문자열

data = [1, 3, 5, 7.0, 9, 'hello']
data = pd.Series(data)

data.dtypes

dtype('O')

In [19]:
data = [1, 3, 5, 7.0, 9, 'hello']
data

[1, 3, 5, 7.0, 9, 'hello']

In [20]:
type(data)

list

In [22]:
# object 라고 하더라도 숫자는 int, 문자는 str

data = [1, 3, 5, 7.0, 9, 'hello']
data = pd.Series(data)

data

0        1
1        3
2        5
3        7
4        9
5    hello
dtype: object

In [23]:
5 == 5 and '5' == '5'

True

In [25]:
data = [1, 3, 5, 7.0, 9, '5']
data = pd.Series(data)

data.dtypes

dtype('O')

In [26]:
# 파이썬에서 사용할 수 있는 공학용 계산기 입니다.

import numpy as np

In [32]:
data = [1]
data = pd.Series(data)

data.dtypes

dtype('int64')

In [33]:
# np.nan 은 결측치르 의미한다.
# nan == not a number 의 약자 입니다.
# 비어있는 값을 의미합니다.
# 결측치는 float 타입니다.

data = [1, np.nan]
data = pd.Series(data)

data.dtypes

dtype('float64')

In [34]:
data = [1, np.nan, 5, 7, 9]
data = pd.Series(data)

data.dtypes

dtype('float64')

In [37]:
# 결측치 유뮤를 보고자 할 때

data.isnull()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [38]:
# 비어있는 값은 결측치가 아닙니다.
# 아래 테이터는 빈 문자열 입니다.

pd.isnull('')

False

In [40]:
pd.isnull(' ')

False

In [39]:
# 결측치

pd.isnull(np.nan)

True

In [41]:
# 비어있지 않은 값을 가져옵니다.

data.notnull()

0     True
1    False
2     True
3     True
4     True
dtype: bool

In [43]:
# a라는 변수에 결측치를 할당했습니다.

a = np.nan
a

nan

In [44]:
# 결측치를 출력했을 때 nan 이라는 값이 출력된다고 해서 그 값이 nan은 아닙니다.

a == 'nan'

False

In [45]:
# 결측치는 연산응로 비교할 수 없습니다.

a == np.nan

False

In [46]:
pd.isnull(a)

True

In [48]:
pd.notnull(a)

False

In [50]:
data = []
data

[]

In [55]:
# 판다스에서 통계연산을 할 때는 결측치를 제외하고 연산합니다.

data = [1, np.nan, 5, 7, 8]
data = pd.Series(data)
data.mean()
#data

5.25

In [56]:
# 결측치에 임의의 값을 써주게 되면 통계수치가 잘못될 수 있습니다.

data = [1, 0, 5, 7, 8]
data = pd.Series(data)
data.mean()
#data

4.2

## DataFrame

In [6]:
transaction_url = "https://bit.ly/dsa-transaction"

transaction = pd.read_csv(transaction_url, index_col = "Name")
transaction

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

## 정렬하기

In [7]:
transaction.sort_index(ascending=True)

            date  price      state
Name
Choi  2017-01-03    900  confirmed
Jang  2017-01-09    600   canceled
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Ko    2017-01-10    200   canceled
Lee   2017-01-07    500   canceled
Park  2017-01-05    800  confirmed
Yoon  2017-01-09    700  confirmed

In [8]:
# Shift + Tab 키를 누르시면 도움말을 보실 수 있습니다.

transaction_sort = transaction.sort_index(ascending=False)
transaction_sort

            date  price      state
Name
Yoon  2017-01-09    700  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Ko    2017-01-10    200   canceled
Kim   2017-01-03    700  confirmed
Kang  2017-01-01    500  confirmed
Jang  2017-01-09    600   canceled
Choi  2017-01-03    900  confirmed

In [9]:
# by에 정렬할 컬럼명을 써줍니다.

transaction.sort_values(by="price", ascending=False)

            date  price      state
Name
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Kim   2017-01-03    700  confirmed
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Kang  2017-01-01    500  confirmed
Lee   2017-01-07    500   canceled
Ko    2017-01-10    200   canceled

In [10]:
# 리스트에 지정해준 순서대로 정렬 됩니다.

transaction.sort_values(by=["date", "price"], ascending=False)

            date  price      state
Name
Ko    2017-01-10    200   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Lee   2017-01-07    500   canceled
Park  2017-01-05    800  confirmed
Choi  2017-01-03    900  confirmed
Kim   2017-01-03    700  confirmed
Kang  2017-01-01    500  confirmed

In [11]:
# 리스트를 지정했으면 리스트로 정리하라

transaction.sort_values(by=["date", "price"], ascending=[True, False])

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Choi  2017-01-03    900  confirmed
Kim   2017-01-03    700  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

#### Series 정렬하기

In [12]:
# 데이터 프레임 전체를 정렬할 수도 있지만 Series로 불러온 데이터도 정렬할 수 있습니다.

transaction["date"].sort_values()

Name
Kang    2017-01-01
Kim     2017-01-03
Choi    2017-01-03
Park    2017-01-05
Lee     2017-01-07
Yoon    2017-01-09
Jang    2017-01-09
Ko      2017-01-10
Name: date, dtype: object

In [13]:
transaction["date"].sort_values(ascending=False)

Name
Ko      2017-01-10
Jang    2017-01-09
Yoon    2017-01-09
Lee     2017-01-07
Park    2017-01-05
Choi    2017-01-03
Kim     2017-01-03
Kang    2017-01-01
Name: date, dtype: object

### 정렬하기 + 미리보기

In [14]:
# 상위 매출, 혹은 날짜 등을 가져올 때 sort_values 와 head 를 같이 사용합니다.

transaction.sort_values(by="price", ascending=False).head()

            date  price      state
Name
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Kim   2017-01-03    700  confirmed
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled

### pivot table

In [15]:
# aggfunc 으로 계산하고자 하는 통계를 입력해 줄 수 있습니다.
# 기본값은 mean 평균입니다.
# Shift + Tab 으로 옵션을 보실 수 있습니다.

pd.pivot_table(transaction, index="state", values="price", aggfunc="sum")

           price
state
canceled    1300
confirmed   3600

In [16]:
pd.pivot_table(transaction, index="state", values="price")

                price
state
canceled   433.333333
confirmed  720.000000

In [17]:
pd.pivot_table(transaction, 
               index=["date", "state"],
               values="price", 
               aggfunc=["mean", "sum"])

                      mean   sum
                     price price
date       state
2017-01-01 confirmed   500   500
2017-01-03 confirmed   800  1600
2017-01-05 confirmed   800   800
2017-01-07 canceled    500   500
2017-01-09 canceled    600   600
           confirmed   700   700
2017-01-10 canceled    200   200

### Group by

In [18]:
# Serise 형태로 보여지며, 속도가 빠름
# 소괄호는 groupby 의 메소드 변수 지정,
# 뒤에 대괄호[]는 그룹화 해서 가져온 값을 어떤 value로 집계해서 볼 컬럼을 지정
# 집계할 통계수치는 직접 sum, mean, max 등을 지정합니다.

transaction.groupby("state")["price"].mean()

state
canceled     433.333333
confirmed    720.000000
Name: price, dtype: float64

In [19]:
transaction.groupby("state")["price"].sum()

state
canceled     1300
confirmed    3600
Name: price, dtype: int64

In [20]:
transaction.groupby(["date", "state"])["price"].sum()

date        state
2017-01-01  confirmed     500
2017-01-03  confirmed    1600
2017-01-05  confirmed     800
2017-01-07  canceled      500
2017-01-09  canceled      600
            confirmed     700
2017-01-10  canceled      200
Name: price, dtype: int64

#### pivot_table 과 groupby 속도 비교

In [21]:
%timeit pd.pivot_table(transaction, index="state", values="price")

3.73 ms ± 43.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [22]:
%timeit transaction.groupby("state")["price"].mean()

512 µs ± 6.86 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

### apply

In [23]:
# 함수에 넘겨주는 파라메터 값은 컬럼명과 달라도 상관없습니다.

def is_vip(price):
    if price >=500:
        return "VIP"
    else:
        return "Non-VIP"

In [24]:
is_vip(500)

'VIP'

In [25]:
# Series 데이터로 apply

transaction["price"].apply(is_vip)

Name
Kang        VIP
Kim         VIP
Choi        VIP
Park        VIP
Lee         VIP
Yoon        VIP
Jang        VIP
Ko      Non-VIP
Name: price, dtype: object

In [28]:
transaction

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

In [30]:
def is_vip(row):
    price = row["price"]
    state = row["state"]
    
    if state == "confirmed" and price >=500:
        return "VIP"
    else:
        return "Non-VIP"

In [31]:
# 데이트프레임의 여러 컬럼을 사용
# apply에 행전체를 넘겨줍니다.

transaction.apply(is_vip, axis = "columns")

Name
Kang        VIP
Kim         VIP
Choi        VIP
Park        VIP
Lee     Non-VIP
Yoon        VIP
Jang    Non-VIP
Ko      Non-VIP
dtype: object

In [32]:
transaction

            date  price      state
Name
Kang  2017-01-01    500  confirmed
Kim   2017-01-03    700  confirmed
Choi  2017-01-03    900  confirmed
Park  2017-01-05    800  confirmed
Lee   2017-01-07    500   canceled
Yoon  2017-01-09    700  confirmed
Jang  2017-01-09    600   canceled
Ko    2017-01-10    200   canceled

### 여러 개의 데이터를 하나로 합치기

In [131]:
transaction01 = pd.read_csv("data/transaction/201701.csv")
transaction01

   Name        date  amount product     result
0  Kang  2017-01-01     500   apple  confirmed
1   Kim  2017-01-03     700  banana  confirmed
2  Choi  2017-01-05     800   apple  confirmed
3  Park  2017-01-07     500  cereal   canceled
4  Kang  2017-01-08    1200    kiwi  confirmed
5  Choi  2017-01-09     100   melon  confirmed
6   Lee  2017-01-09     700  banana  confirmed
7  Yoon  2017-01-10     200  cereal   canceled

In [132]:
transaction02 = pd.read_csv("data/transaction/201702.csv")
transaction02

   Name        date  amount product     result
0   Kim  2017-02-04     100  cereal  confirmed
1  Kang  2017-02-12     200    kiwi   canceled
2  Kang  2017-02-15     650  banana  confirmed
3  Park  2017-02-28     420  cereal  confirmed

In [141]:
transaction = pd.concat([transaction01, transaction02])

print(transaction.shape)
transaction.head()

(12, 5)

   Name        date  amount product     result
0  Kang  2017-01-01     500   apple  confirmed
1   Kim  2017-01-03     700  banana  confirmed
2  Choi  2017-01-05     800   apple  confirmed
3  Park  2017-01-07     500  cereal   canceled
4  Kang  2017-01-08    1200    kiwi  confirmed

In [139]:
user = pd.read_csv("data/transaction/user.csv")
user

   Name  Age     Sex                Email
0  Kang   30    male       kang@gmail.com
1   Kim   22  female        kim@naver.com
2  Park   37    male  park@dsschool.co.kr
3   Lee   15  female      lee@empas.co.kr
4   Son   29    male     son@google.co.uk
5  Moon   40  female     moon@hanmail.com
6  Choi   34    male       choi@yahoo.com

In [140]:
product = pd.read_csv("data/transaction/product.csv")
product

     product  price
0      apple    5.0
1  blueberry    7.0
2     banana    2.5
3     cereal    4.5
4       kiwi   10.0
5      melon   12.5
6  pineapple   15.0

In [143]:
# 동일한 컬럼이 있으면 해당 컬럼을 키값으로 연결해 줍니다.

pd.merge(transaction, user).head()

   Name        date  amount product     result  Age     Sex           Email
0  Kang  2017-01-01     500   apple  confirmed   30    male  kang@gmail.com
1  Kang  2017-01-08    1200    kiwi  confirmed   30    male  kang@gmail.com
2  Kang  2017-02-12     200    kiwi   canceled   30    male  kang@gmail.com
3  Kang  2017-02-15     650  banana  confirmed   30    male  kang@gmail.com
4   Kim  2017-01-03     700  banana  confirmed   22  female   kim@naver.com

In [145]:
# 키값을 직접 지정해 줄 수도 있습니다.

pd.merge(transaction, user, on="Name")

,Name,date,amount,product,result,Age,Sex,Email
0,Kang,2017-01-01,500,apple,confirmed,30,male,kang@gmail.com
1,Kang,2017-01-08,1200,kiwi,confirmed,30,male,kang@gmail.com
2,Kang,2017-02-12,200,kiwi,canceled,30,male,kang@gmail.com
3,Kang,2017-02-15,650,banana,confirmed,30,male,kang@gmail.com
4,Kim,2017-01-03,700,banana,confirmed,22,female,kim@naver.com
5,Kim,2017-02-04,100,cereal,confirmed,22,female,kim@naver.com
6,Choi,2017-01-05,800,apple,confirmed,34,male,choi@yahoo.com
7,Choi,2017-01-09,100,melon,confirmed,34,male,choi@yahoo.com
8,Park,2017-01-07,500,cereal,canceled,37,male,park@dsschool.co.kr
9,Park,2017-02-28,420,cereal,confirmed,37,male,park@dsschool.co.kr
10,Lee,2017-01-09,700,banana,confirmed,15,female,lee@empas.co.kr

In [146]:
# 연결하고자 하는 키가 다를 수도 있습니다.

pd.merge(transaction, user, left_on="Name", right_on="Name")

,Name,date,amount,product,result,Age,Sex,Email
0,Kang,2017-01-01,500,apple,confirmed,30,male,kang@gmail.com
1,Kang,2017-01-08,1200,kiwi,confirmed,30,male,kang@gmail.com
2,Kang,2017-02-12,200,kiwi,canceled,30,male,kang@gmail.com
3,Kang,2017-02-15,650,banana,confirmed,30,male,kang@gmail.com
4,Kim,2017-01-03,700,banana,confirmed,22,female,kim@naver.com
5,Kim,2017-02-04,100,cereal,confirmed,22,female,kim@naver.com
6,Choi,2017-01-05,800,apple,confirmed,34,male,choi@yahoo.com
7,Choi,2017-01-09,100,melon,confirmed,34,male,choi@yahoo.com
8,Park,2017-01-07,500,cereal,canceled,37,male,park@dsschool.co.kr
9,Park,2017-02-28,420,cereal,confirmed,37,male,park@dsschool.co.kr
10,Lee,2017-01-09,700,banana,confirmed,15,female,lee@empas.co.kr

In [147]:
# 결측치를 빼과, 값이 있는 경우만 연결

pd.merge(transaction, user, how='inner')

,Name,date,amount,product,result,Age,Sex,Email
0,Kang,2017-01-01,500,apple,confirmed,30,male,kang@gmail.com
1,Kang,2017-01-08,1200,kiwi,confirmed,30,male,kang@gmail.com
2,Kang,2017-02-12,200,kiwi,canceled,30,male,kang@gmail.com
3,Kang,2017-02-15,650,banana,confirmed,30,male,kang@gmail.com
4,Kim,2017-01-03,700,banana,confirmed,22,female,kim@naver.com
5,Kim,2017-02-04,100,cereal,confirmed,22,female,kim@naver.com
6,Choi,2017-01-05,800,apple,confirmed,34,male,choi@yahoo.com
7,Choi,2017-01-09,100,melon,confirmed,34,male,choi@yahoo.com
8,Park,2017-01-07,500,cereal,canceled,37,male,park@dsschool.co.kr
9,Park,2017-02-28,420,cereal,confirmed,37,male,park@dsschool.co.kr
10,Lee,2017-01-09,700,banana,confirmed,15,female,lee@empas.co.kr

In [150]:
# 결측치 포함, 값이 없는 경우도 연결

pd.merge(transaction, user, how='outer')

,Name,date,amount,product,result,Age,Sex,Email
0,Kang,2017-01-01,500.0,apple,confirmed,30.0,male,kang@gmail.com
1,Kang,2017-01-08,1200.0,kiwi,confirmed,30.0,male,kang@gmail.com
2,Kang,2017-02-12,200.0,kiwi,canceled,30.0,male,kang@gmail.com
3,Kang,2017-02-15,650.0,banana,confirmed,30.0,male,kang@gmail.com
4,Kim,2017-01-03,700.0,banana,confirmed,22.0,female,kim@naver.com
5,Kim,2017-02-04,100.0,cereal,confirmed,22.0,female,kim@naver.com
6,Choi,2017-01-05,800.0,apple,confirmed,34.0,male,choi@yahoo.com
7,Choi,2017-01-09,100.0,melon,confirmed,34.0,male,choi@yahoo.com
8,Park,2017-01-07,500.0,cereal,canceled,37.0,male,park@dsschool.co.kr
9,Park,2017-02-28,420.0,cereal,confirmed,37.0,male,park@dsschool.co.kr
10,Lee,2017-01-09,700.0,banana,confirmed,15.0,female,lee@empas.co.kr
11,Yoon,2017-01-10,200.0,cereal,canceled,NaN,NaN,NaN
12,Son,NaN,NaN,NaN,NaN,29.0,male,son@google.co.uk
13,Moon,NaN,NaN,NaN,NaN,40.0,female,moon@hanmail.com

In [152]:
pd.merge(transaction, user, how='left')

,Name,date,amount,product,result,Age,Sex,Email
0,Kang,2017-01-01,500,apple,confirmed,30.0,male,kang@gmail.com
1,Kim,2017-01-03,700,banana,confirmed,22.0,female,kim@naver.com
2,Choi,2017-01-05,800,apple,confirmed,34.0,male,choi@yahoo.com
3,Park,2017-01-07,500,cereal,canceled,37.0,male,park@dsschool.co.kr
4,Kang,2017-01-08,1200,kiwi,confirmed,30.0,male,kang@gmail.com
5,Choi,2017-01-09,100,melon,confirmed,34.0,male,choi@yahoo.com
6,Lee,2017-01-09,700,banana,confirmed,15.0,female,lee@empas.co.kr
7,Yoon,2017-01-10,200,cereal,canceled,NaN,NaN,NaN
8,Kim,2017-02-04,100,cereal,confirmed,22.0,female,kim@naver.com
9,Kang,2017-02-12,200,kiwi,canceled,30.0,male,kang@gmail.com
10,Kang,2017-02-15,650,banana,confirmed,30.0,male,kang@gmail.com
11,Park,2017-02-28,420,cereal,confirmed,37.0,male,park@dsschool.co.kr

In [151]:
pd.merge(transaction, user, how='right')

,Name,date,amount,product,result,Age,Sex,Email
0,Kang,2017-01-01,500.0,apple,confirmed,30,male,kang@gmail.com
1,Kang,2017-01-08,1200.0,kiwi,confirmed,30,male,kang@gmail.com
2,Kang,2017-02-12,200.0,kiwi,canceled,30,male,kang@gmail.com
3,Kang,2017-02-15,650.0,banana,confirmed,30,male,kang@gmail.com
4,Kim,2017-01-03,700.0,banana,confirmed,22,female,kim@naver.com
5,Kim,2017-02-04,100.0,cereal,confirmed,22,female,kim@naver.com
6,Choi,2017-01-05,800.0,apple,confirmed,34,male,choi@yahoo.com
7,Choi,2017-01-09,100.0,melon,confirmed,34,male,choi@yahoo.com
8,Park,2017-01-07,500.0,cereal,canceled,37,male,park@dsschool.co.kr
9,Park,2017-02-28,420.0,cereal,confirmed,37,male,park@dsschool.co.kr
10,Lee,2017-01-09,700.0,banana,confirmed,15,female,lee@empas.co.kr
11,Son,NaN,NaN,NaN,NaN,29,male,son@google.co.uk
12,Moon,NaN,NaN,NaN,NaN,40,female,moon@hanmail.com